[
  {
    "path": "posts/2021-06-03-covid19/",
    "title": "Data on Covid 19",
    "description": "This will be a on going blog about Covid 19",
    "author": [
      {
        "name": "Demetrio Munoz",
        "url": {}
      }
    ],
    "date": "2021-06-03",
    "categories": [],
    "contents": "\r\nlibraries\r\n\r\n\r\nlibrary(ggplot2)\r\nlibrary(tidyverse)\r\nlibrary(dplyr)\r\n\r\n\r\n\r\nImporting data\r\n\r\n\r\n\r\nIntroduction\r\nThe following data comes from a repository from the github Our world in data. The data has been collected since January 2020 and is on going. The data sets contains all the information for Covid-19. From the author Our World In Data “Our complete Covid-19 data set is a collection of the COVID-19 data maintained by Our World in Data. It is updated daily and includes data on confirmed cases, deaths, hospitalizations, testing, and vaccinations as well as other variables of potential interest.” I will be doing an analysis on the data to find if their is any relationship within the data. I will be answering some easy questions along the way.\r\nExploration of Populations:\r\nThe first thing I will be looking at from the covid-19 data set will be population. My first observation gives me information of the total population of 2020-2021. The data includes a population of only 809 residents. The max population of the covid-19 dataset is 7,794,798,729. The mean of the population is 126,013,661. The IQR of the populations is 32588139.\r\n\r\n   population       \r\n Min.   :4.700e+01  \r\n 1st Qu.:2.226e+06  \r\n Median :9.890e+06  \r\n Mean   :1.252e+08  \r\n 3rd Qu.:3.481e+07  \r\n Max.   :7.795e+09  \r\n[1] 32588139\r\n\r\nHistogram of Populations\r\nThe following histogram of populations shows the distribution of the populations in intervals. The most frequent population is within the 16 interval, the coefficients the histogram is 0.005044, 0.001727.\r\n\r\n\r\n\r\nDensity line for populations\r\nThe following line of density shows the peak of the populations, it shows that it is not normally distributed. It is skewed to the right meaning that the world populations are usually large.\r\n\r\n\r\n\r\nDensity Curve\r\nThe following histogram is on population with its line density. We can see the constant is population is 92490, it falls with the interval that contains the peak.\r\n\r\n\r\n\r\nGeographical location:\r\nI want to know how many continents are there, is there missing continents? Is there anything that stands out from this data set. The number of continents is 7, there is no missing continent. The table shows that three continents have large numbers this could be a for a lot of reasons. one reason it can be because of the population or there could be another reason ill be looking more into this. This could mean that maybe some of these continents did not get heavily impacted by Covid-19. Something else that is interesting about the continents is that Antarctica had the lowest number 3620, the highest was Australia with 25035. The other interesting insight that the table shows is that Africa, Europe had almost the same number but Europe came ahead with 23043, Africa had 23022. This is interesting because the continent that lies in the middle of them had a number of only 4570.\r\n\r\nconf\r\n   Aust    Afri    Asia  Europe  N Amer Oceania  S Amer \r\n   4570   25035   23043   23022   11989    3620    5847 \r\n.\r\n                     Africa          Asia        Europe North America \r\n         4570         25035         23043         23022         11989 \r\n      Oceania South America \r\n         3620          5847 \r\n\r\nBar graph\r\nThe following bar graph shows the geographical location distribution for the 7 continents that data was include on the Covid-19. We can see that the Oceania, Australian continents had the smallest range of geographical participation.The data shows that Africa had the highest range. the other two that follow are the Asian and European continent.\r\n\r\n\r\n\r\nAll of the seven continents are included.\r\nFemale smokers population & other information\r\nThe following question I will look into is the distribution of female and smokers population by creating a table.\r\nFemale smoker population percent\r\nThe following table shows that females\r\n\r\n# A tibble: 68,301 x 2\r\n   female_smokers population\r\n            <dbl>      <dbl>\r\n 1            7.1    2877800\r\n 2            7.1    2877800\r\n 3            7.1    2877800\r\n 4            7.1    2877800\r\n 5            7.1    2877800\r\n 6            7.1    2877800\r\n 7            7.1    2877800\r\n 8            7.1    2877800\r\n 9            7.1    2877800\r\n10            7.1    2877800\r\n# ... with 68,291 more rows\r\n female_smokers    population       \r\n Min.   : 0.10   Min.   :1.083e+04  \r\n 1st Qu.: 1.90   1st Qu.:3.546e+06  \r\n Median : 6.30   Median :1.014e+07  \r\n Mean   :10.56   Mean   :1.114e+08  \r\n 3rd Qu.:19.30   3rd Qu.:3.785e+07  \r\n Max.   :44.00   Max.   :7.795e+09  \r\n\r\nThe following code will be for scatterplot\r\n\r\n\r\n\r\nFemale Smokers information\r\n\r\n# A tibble: 48,723 x 10\r\n   female_smokers diabetes_prevalen~ cardiovasc_death~ extreme_poverty\r\n            <dbl>              <dbl>             <dbl>           <dbl>\r\n 1            7.1               10.1              304.             1.1\r\n 2            7.1               10.1              304.             1.1\r\n 3            7.1               10.1              304.             1.1\r\n 4            7.1               10.1              304.             1.1\r\n 5            7.1               10.1              304.             1.1\r\n 6            7.1               10.1              304.             1.1\r\n 7            7.1               10.1              304.             1.1\r\n 8            7.1               10.1              304.             1.1\r\n 9            7.1               10.1              304.             1.1\r\n10            7.1               10.1              304.             1.1\r\n# ... with 48,713 more rows, and 6 more variables:\r\n#   gdp_per_capita <dbl>, aged_70_older <dbl>, aged_65_older <dbl>,\r\n#   median_age <dbl>, population_density <dbl>, population <dbl>\r\n female_smokers  diabetes_prevalence cardiovasc_death_rate\r\n Min.   : 0.10   Min.   : 0.990      Min.   : 85.75       \r\n 1st Qu.: 1.90   1st Qu.: 4.790      1st Qu.:152.78       \r\n Median : 6.30   Median : 6.740      Median :243.81       \r\n Mean   :10.14   Mean   : 6.933      Mean   :254.25       \r\n 3rd Qu.:18.80   3rd Qu.: 8.380      3rd Qu.:329.94       \r\n Max.   :44.00   Max.   :22.020      Max.   :546.30       \r\n extreme_poverty gdp_per_capita    aged_70_older    aged_65_older   \r\n Min.   : 0.10   Min.   :  752.8   Min.   : 1.285   Min.   : 2.168  \r\n 1st Qu.: 0.50   1st Qu.: 4541.8   1st Qu.: 2.647   1st Qu.: 4.489  \r\n Median : 1.50   Median :12236.7   Median : 5.030   Median : 7.918  \r\n Mean   :11.35   Mean   :17729.0   Mean   : 6.231   Mean   : 9.725  \r\n 3rd Qu.:16.00   3rd Qu.:25129.3   3rd Qu.: 9.842   3rd Qu.:14.864  \r\n Max.   :71.40   Max.   :94278.0   Max.   :16.240   Max.   :23.021  \r\n   median_age   population_density   population       \r\n Min.   :15.1   Min.   :   1.98    Min.   :9.834e+04  \r\n 1st Qu.:24.4   1st Qu.:  37.73    1st Qu.:4.938e+06  \r\n Median :30.9   Median :  81.72    Median :1.295e+07  \r\n Mean   :31.5   Mean   : 144.16    Mean   :1.473e+08  \r\n 3rd Qu.:39.7   3rd Qu.: 143.37    3rd Qu.:4.675e+07  \r\n Max.   :47.9   Max.   :1454.04    Max.   :7.795e+09  \r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-06-03-covid19/covid19.jpg",
    "last_modified": "2021-07-02T21:05:13-07:00",
    "input_file": "covid19.knit.md"
  },
  {
    "path": "posts/2021-05-26-2012-animes/",
    "title": "2012 animes",
    "description": "The following blog will be about the top anime of 2012.",
    "author": [
      {
        "name": "Demetrio Munoz",
        "url": {}
      }
    ],
    "date": "2021-05-26",
    "categories": [],
    "contents": "\r\nAre you anime lover and do not know what to watch?\r\nTop 20 anime for 2012 overview\r\nThe following list of anime are from 2012 collection created by IMDb tv. The list is based on the most popular anime of 2012, the genres on this list are very broad. The anime that came number one in this anime list on 2012 based on popularity is JoJo’s Bizzare Adventure its genre is action, and adventure. JoJo Bizzare is for those anime lovers who love a good fight scene with a very interesting story line. The anime that came in second was Sword Art Online, the genre of this anime is action and adventure. This anime is for those anime lovers like anime that are based on virtual reality. The anime that came in 3rd place was Kuroko’s Basketball and the genre of this anime is for basketball lovers. The anime coming in at fourth place is Psycho Pass and this anime is for those anime lovers who love a good action, crime anime. The fifth anime of this list is the anime called Another and this anime is recommended for those anime lovers who love Horror anime genre. I will only mention the top 5 anime for 2012 the rest of the you can explore for yourself but they are high reccommended to watch.\r\nThe list was not created by me I got list from IMDb Website for the most popular anime of 2012. I hope this anime list can help anyone looking for anime recommendations. Head over to favorite website and start binging on one of these animes now.\r\n\r\n1.JoJo’s Bizzare Adventure\r\nGenre: Animation, Action, Adventure\r\nAs the title suggests, JoJo’s Bizarre Adventure is one of the most amazingly bizarre shonen anime of all time that spans many excitingly different seasons. This anime is jam-packed with crazy action and iconic moments that are known to practically all of the anime community.\r\nsource: CrunchyRoll\r\n\r\n2. Sword Art Online\r\nGenre: Animation, Action, Adventure\r\nThe battle for survival in this MMORPG gave SAO a very solid plot, at least for the first half of the series. Character motives and relationships were clear and each interaction created a different perspective of the lead character Kirito. His partner Asuna also displayed a strength not usually seen in female anime characters. But as soon as the second arc of this light novel adaptation began, the story and its characters begun to crumble. Asuna was cast to the sideline as a princess that needed saving and Kirito was “trapped” within the virtual world unable to face reality yet without Asuna.\r\nDespite its weaknesses, SAO’s breathtaking scenery and fluid animation cannot be ignored. The first opening song, Crossing Field by Lisa, was a very memorable piece fit for the series. If not for the flaws of the second half of the series, SAO would have ranked better this year.\r\nSource: CrunchyRoll\r\n\r\n3.Kurokos’s Basketball\r\nGenre: Animation, Comedy, Sport\r\nI was never a fan of sports anime but Kuroko no Basket is such an enjoyable watch I could not afford to miss it! More than the basketball which I came to love because of this series, the character interactions – their teamwork, and all the moments in between felt real. So was the fact that no matter how hard we work on achieving something, we cannot always win. Let’s not forget how our lead characters can be such eye candies and even though the voice cast are not all well-known, they have done a great job of bringing to life each character.\r\nSource: AnimePlanet\r\n\r\n4.Psycho-Pass\r\nGenre: Animation, Action, Crime\r\nBelieving in humanity and order, policewoman Akane Tsunemori obeys the ruling, computerized, precognitive Sibyl System. But when she faces a criminal mastermind who can elude this “perfect” system, she questions both Sibyl and herself.\r\nSource: AnimePlanet\r\n\r\n5.Another\r\nGenre: Animation, Drama, Horror\r\nWhen Kouichi Sakakibara (15) transfers to Yomiyama North Middle School, he senses something out of place in the atmosphere of a class that seems to be afraid of something. Kouichi is drawn to a mysterious girl, Mei Misaki, and tries to make contact with her, only to find more mysteries. As he does, the class is stricken by a disaster that nobody could have imagined! Just what is going on in this “world”?\r\nSource: Animeplanet\r\n\r\n6.Magi: The labyrinth of Magic\r\nGenre: Animation, Action, Adventure\r\nMagi: The Labyrinth of Magic is full of adventure and wonder as you follow a young Alladin who comes upon an all-powerful djinn. The anime is a fun watch and has a surprising amount of action for those that are fans of shonen.\r\nSource: CrunchyRoll\r\n\r\n7.Kamishama hajimemashita\r\nGenre: Animation, Comedy, Fantasy\r\nNanami Momozono’s dad skips town, she is then visited by debt collectors and kicked out of her home. So when a man offers her his home, she immediately accepts. The place is a shrine, and Nanami has unknowingly taken over his job as a local deity.\r\nSource: CrunchyRoll\r\n\r\n8.K\r\nGenre: Animation, Action, Drama\r\nJapan has reclaimed its former glory under the guidance of Kings, charismatic individuals wielding incredible powers. But now, one of the Red King’s vassals has been murdered, and a viral video shows the killer’s confession at the scene. He is one Yashiro Isana, claiming to be the Colorless King; and he is now a wanted man - not only to the Red King’s faction, but also the Blues charged with keeping the peace. He is even sought by Kuroh Yatogami, a knight of the former Colorless King sworn to slay any unworthy successor. Only, the subject of their struggle, “Shiro”, is a nondescript young man living an unremarkable life in an island academy, and seems to have no recollection of killing anyone. To keep his life, Shiro must prove his innocence; but what is the truth behind his mysterious past, and what will be the outcome of this confrontation of Kings?\r\nSource: Forevergeek\r\n\r\n9.Nisemonogatari\r\nGenre: Animation, Comedy, Drama\r\nWith Oshino gone and school out for summer, Araragi heads into the break hoping to spend his time relaxing, working on his classwork with Hanekawa, hanging out with his girlfriend Senjogahara, and maybe even finding a little time to molest Hachikuji as he wanders the streets. But when his sisters get tangled up in investigating a ring of curses circulating their middle school, the boy finds himself once again involved with strange characters and unexplained oddities. With only his vampiric mistress Shinobu for help, will Koyomi Araragi be able to solve the strange mystery uncovered by his “Fire Sisters”?\r\nSource: IMDb\r\n\r\n10.Joshiraku\r\nGenre: Animation, Comedy\r\nA joint effort between popular illustrator Yasu and KUMETA Kouji, creator of Sayonara Zetsubou Sensei, this manga features female rakugo storytellers. After stepping off the stage, these comedians chit-chat in the girl’s dressing room. This is a comedy that begins after the storyteller has said goodbye to the audience!\r\nSource: IMDb\r\n\r\n11.Star Blazers 2199\r\nGenre: Animation, Action, Adventure\r\nThe year is 2199. The human race has been crushed in their war with the Gamilos, driven into underground cities by the invader’s assault. Scientists estimate they have only a year left. The young officers Susumu Kodai and Daisuke Shima receive a mysterious capsule from a ship that made an emergency landing on Mars and return with it to Earth. It contains humanity’s last hope: the planet Iscandar on the other side of the Magellan Galaxy has the technology to defeat the Gamilos and restore the planet. The space battleship Yamato is entrusted with this task, but they have only one year before humanity ends.\r\nSource: CrunchyRoll\r\n\r\n12.Girl und Panzer\r\nGenre: Animation, Action, Comedy\r\nForget track and field! At Oorai Girls Academy, they practice Shensha-do, the art of tank combat! But Miho transfers there believing it to be the one school where Shensa-do isn’t offered. She’s in for a rude awakening, however, when the student council president demands her participation in the sport. Together with four friends, she learns to face her fears, find herself, and have a whole lot of fun along the way. Get ready for tank fighting mayhem in Girls Und Panzer!\r\nSource: AnimePlanet\r\n\r\n13.Nyaruko: Crawling with Love\r\nGenre: Animation, Action, Comedy\r\nShe is the malign deity “Crawling Chaos” Nyarlathotep, or Nyarko for short. Together with “Living Flame” Cthuga, or Kuko, and “The Unspeakable One” Hastur, or Hasuta, they bring you an abysmally terrifying Love(craft) comedy!\r\nDeities arrive on Earth one after another in search of Yasaka Mahiro and Nyaruko. Nyaruko and her Space CQC take on all of them. What is the truth behind these incidents of cosmic scale? Will Mahiro be able to live in peace?\r\nSource: Forevergeek\r\n\r\n14.Medaka Box\r\nGenre: Animation, Action, Comedy\r\nThe gorgeous, peerless student council president, Medaka Kurokami, solves everyone’s problems! Medaka Kurokami, who has just become Sandbox Academy’s 98th student council president, sets up a suggestion box as promised in her election campaign. “Your dreams belong to you. Go after them and make them come true yourself. Your worries, however, belong to me. Send them all my way!!” As Medaka solves her fellow students’ problems along with her friend since childhood, Zenkichi Hitoyoshi, her suggestion box, nicknamed the Medaka Box, earns great popularity among the students.\r\nSource: IMDb\r\n\r\n15.Zetman\r\nGenre: Animation, Action, Sci-Fi\r\nJin is an energetic young boy living in a shanty town and making ends meet by performing good deeds for money. However, when his mentor dies during a fight with a strange monster he finally learns the meaning of death. Having been taken in by a stripper named Akemi whom he once saved, Jin begins to live a quiet and normal life - though in reality he is anything but ordinary. With superhuman abilities and a group of mysterious men searching for him under the name of Zet, over the years Jin finds himself drawn into a world of creatures with dangerous powers called “Players”. But what is Jin really, and with his vicious methods of defeating these threats, is he really a hero for justice or simply another dangerous monster?\r\nSource: Forevergeek\r\n\r\n16.Uchû kyôdai\r\nGenre: Animation, Comedy\r\nOne evening two brothers see what appears to be a UFO in the sky. Whether or not that was the case becomes irrelevant, but it does spark an interest in space and the two brothers make a promise to go to space one day. Now, many years later, the younger brother Hibito is about to realize his dream, while the older brother Mutta just got fired from his job. After an aimless period in his life, his family helps re-ignite his fire and he becomes an applicant to the Japanese space agency in the hopes of making it up there some day.\r\nSource: Forevergeek\r\n\r\n17.Aquarion EVOL\r\nGenre: Animation, Action, Romance\r\nAquarion Evol (アクエリオンEVOL Akuerion Evoru) is the sequel to the 2005 anime series Genesis of Aquarion. It was originally announced on February 25, 2011, by the production staff. It premiered on TV Tokyo on January 8, 2012, as an hour-long special that combined the first two episodes in a single broadcast.\r\nSource: Animeplanet\r\n\r\n18.Bodacious Space Pirates\r\nGenre: Animation, Action, Romance\r\nMarika is living the normal life of an average girl in space: attending her school’s yacht club, keeping up with the latest trends, and working part time. One day can change a lot, however. Not only was her late father a notorious space pirate, he was also the Captain of the equally notorious Benten Maru! What’s worse, she’s just inherited his position and the pirate’s life that comes with it.\r\nSource: CrunchyRoll\r\n\r\n19.Terumae Romae\r\nGenre: Animation\r\nLucius, a Roman architect, is transported through time to modern-day Japan, where he learns about Japanese bathhouses and uses this to his gain back home.\r\nSource: IMDb\r\n\r\n20.Wooser no Sono Higurashi\r\nGenre: Animation\r\nWooser is an adorable creature with a not-so-adorable fetish for panties and school girls. Alongside the lovely ladies Miho, Ren and Rin, Wooser always manages to have a fun time, whether the gang has a DJ dance party, forms sculptures out of clay or even volunteers at the zoo.\r\nSource: IMDb\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-26-2012-animes/JoJo.jpg",
    "last_modified": "2021-05-27T20:25:15-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-25-mk-64-tidytuesday/",
    "title": "mk 64 tidytuesday",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Demetrio Munoz",
        "url": {}
      }
    ],
    "date": "2021-05-25",
    "categories": [],
    "contents": "\r\nMario Kart Data background\r\nThe data this week comes from Mario Kart World Records and contains world records for the classic (if you’re a 90’s kid) racing game on the Nintendo 64.\r\nThis Video talks about the history of Mario Kart 64 World Records in greater detail. Despite it’s release back in 1996 (1997 in Europe and North America), it is still actiely played by many and new world records are achieved every month.\r\nThe game consists of 16 individual tracks and world records can be achieved for the fastest single lap or the fastest completed race (three laps). Also, through the years, players discovered shortcuts in many of the tracks. Fortunately, shortcut and non-shortcut world records are listed separately.\r\nFurthermore, the Nintendo 64 was released for NTSC- and PAL-systems. On PAL-systems, the game runs a little slower. All times in this dataset are PAL-times, but they can be converted back to NTSC-times.\r\nImport data\r\n\r\n\r\n    Downloading file 1 of 2: `drivers.csv`\r\n    Downloading file 2 of 2: `records.csv`\r\n\r\nLoading the data onto objects\r\n\r\n\r\n\r\nLook at the data\r\n\r\nspec_tbl_df [2,334 x 9] (S3: spec_tbl_df/tbl_df/tbl/data.frame)\r\n $ track          : chr [1:2334] \"Luigi Raceway\" \"Luigi Raceway\" \"Luigi Raceway\" \"Luigi Raceway\" ...\r\n $ type           : chr [1:2334] \"Three Lap\" \"Three Lap\" \"Three Lap\" \"Three Lap\" ...\r\n $ shortcut       : chr [1:2334] \"No\" \"No\" \"No\" \"No\" ...\r\n $ player         : chr [1:2334] \"Salam\" \"Booth\" \"Salam\" \"Salam\" ...\r\n $ system_played  : chr [1:2334] \"NTSC\" \"NTSC\" \"NTSC\" \"NTSC\" ...\r\n $ date           : Date[1:2334], format: \"1997-02-15\" ...\r\n $ time_period    : chr [1:2334] \"2M 12.99S\" \"2M 9.99S\" \"2M 8.99S\" \"2M 6.99S\" ...\r\n $ time           : num [1:2334] 133 130 129 127 125 ...\r\n $ record_duration: num [1:2334] 1 0 12 7 54 0 0 27 0 64 ...\r\n - attr(*, \"spec\")=\r\n  .. cols(\r\n  ..   track = col_character(),\r\n  ..   type = col_character(),\r\n  ..   shortcut = col_character(),\r\n  ..   player = col_character(),\r\n  ..   system_played = col_character(),\r\n  ..   date = col_date(format = \"\"),\r\n  ..   time_period = col_character(),\r\n  ..   time = col_double(),\r\n  ..   record_duration = col_double()\r\n  .. )\r\n\r\nVariables of interests for me are ‘time’ which is in seconds, and probably ‘time’ for the type of track and ‘shortcut’ because times will be different if the player used a shortcut. # Question to explore: which track is the fastest start by looking at a distribution of record times.\r\n\r\n\r\n\r\nThe bar chart shows two different peaks this can be because single and three lap tracks. we can also tell that it peaks at 45s ish. This shows that certain tracks are played more than others\r\n\r\n\r\n    Banshee Boardwalk       Bowser's Castle        Choco Mountain \r\n                   83                    69                   148 \r\nD.K.'s Jungle Parkway       Frappe Snowland       Kalimari Desert \r\n                  180                   180                   169 \r\n   Koopa Troopa Beach         Luigi Raceway         Mario Raceway \r\n                   89                   147                   160 \r\n         Moo Moo Farm          Rainbow Road         Royal Raceway \r\n                   81                   179                   149 \r\n         Sherbet Land       Toad's Turnpike         Wario Stadium \r\n                  143                   196                   201 \r\n         Yoshi Valley \r\n                  160 \r\n\r\n16- not too many.. banshee boardwalk and bowser castle don’t seem to be played much because they don’t have a lot of entries in this data set. There could be many factors to why they are not played.\r\n\r\n\r\n\r\nThe track that had most variability on world record time was Rainbow rows it specifically had more variablity in 3 lap track. The tracks that has less world records was the Bowsers Castles, Banshee Boardwalk.\r\n\r\n[1] 1306\r\n\r\nThe fastest time was on wario stadium using shortcut side tangent - what is the time distribution seperated by shortcut\r\n\r\n# A tibble: 1 x 9\r\n  track    type   shortcut player system_played date       time_period\r\n  <chr>    <chr>  <chr>    <chr>  <chr>         <date>     <chr>      \r\n1 Wario S~ Three~ Yes      VAJ    NTSC          2020-07-30 14.59S     \r\n# ... with 2 more variables: time <dbl>, record_duration <dbl>\r\n\r\nThe following box plot shows every single track, if shortcuts were used or not, and it includes the time the track was done. The following tracks did not use shortcuts Banshee Boardwalk, Bowser’s Castle, Koopa Troopa Beach, Moo Moo Farm. The other intersting thing about these tracks is that their time stayed within 100 seconds.\r\n\r\n\r\n\r\nThe interest graph that stands out is the Wario Stadium because of its high peak when using shortcut. Even when a shortcut was used for the track Wario Stadium the time for completion was still relativily high in the beginning.\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-25-mk-64-tidytuesday/mk-64-tidytuesday_files/figure-html5/unnamed-chunk-5-1.png",
    "last_modified": "2021-05-27T20:55:06-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-04-18-cfhl-analysis/",
    "title": "CFHL-Analysis",
    "description": "Exploratory Data Analysis on CFHL project.",
    "author": [
      {
        "name": "Demetrio Munoz",
        "url": {}
      }
    ],
    "date": "2021-04-18",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\nLoading data, loading data onto mydata object\r\n\r\n\r\n\r\nIntroduction\r\nThe data in this Exploratory Analysis comes from a project called CalFresh Healthy Living (CFHL), conducted by the Center for Healthy Communities (CHC) Research and Evaluation team at California State University Chico. Data collection from a self report survey started last summer and is ongoing. The data survey contains information two type of nutrition nutrition classes. One of the type of nutrition class was single session classes, the other type of nutrition class is series based classes. These two type of nutrition classes had different questions to collect different kind of information from the participants. For one time classes the questions asked about how confident the student is in their ability to recall the knowledge and skills that the student learned in the class. Classes mostly asked about the frequency with which the student are particular foods/did specific health behaviors. The series classes also, asked about certain questions to get feedback on the content of the class to test how much did the student learned in the series classes. The data that was collected pre and post series classes only, will show is the course contributes to some changes in knowledge or health behavior. The other interesting data that was collected from both nutrition classes was demographics, food security,education, eating/nutrition knowledge and behaviors, food insecurity, and feedback on the class. This report examines the demographic of students, specifically their class standing, and the number of classes attended to see if there is a relationship between them.\r\nData Summarization\r\nFirst, I’m going examine the class standings who participated in the survey.\r\n\r\n\r\n     Freshman     Sophomore        Junior        Senior      Graduate \r\n          138            91           133           139            26 \r\nNot a student \r\n           20 \r\n\r\nBased on this data table the top three class standings that participated in this survey were Senoir at 139 participants, Freshman at 138, and Junior at 133 participants\r\nGraph displaying top 3 class standing participation\r\n\r\n\r\n\r\nThis bar graph displays the class standing of the students who participated in the survey. This graph illustrates that the top three class standing that took a part of this survey came from Freshman, Junior, Senior,the two lowest class standing that participated in this survey were Graduate, Not a Student.\r\nSecond, I am going to explore how many classes in the series students attended.\r\nThe second measure I am going to look into is about number of classes attended. The question has 1-6 choices so the participant can pick if they participate in 1 number of classes through 6 number of classes.\r\n\r\n\r\n 1  2  3  4  5  6 \r\n45 12 85 31  9  6 \r\n\r\nThis table shows that that every number of classes had more than 6 participants. Minimum is 6 participants,the participants went to only 6 classes. The number of classes that was taken the most was number 3 with a total of 85 participants saying they went to only 3 classes. The third most taken number of classes was 1 number of classes with a total of 45 participants. The average number of classes taken was 2.8.\r\nHistogram displays number of classes participants\r\nThe following histogram displays the number of participants in each number classes, from the graph it is visible that the number of classes that had the most participants was 3 number of classes. From the graph it is visible that every number of classes had at least 3 participants.\r\n\r\n\r\n\r\n\r\n[1] 1\r\n\r\nTable shows class standing and number of classes\r\nThe following table that compares class standing and number of classes. The table shows that graduates,and non-students had no data on the number of classes they took.\r\n\r\n               \r\n                1 2 3 4 5 6\r\n  Freshman      2 2 5 4 3 1\r\n  Sophomore     5 0 0 2 1 0\r\n  Junior        5 2 5 4 1 1\r\n  Senior        7 0 0 2 0 1\r\n  Graduate      0 0 0 0 0 0\r\n  Not a student 0 0 0 0 0 0\r\n\r\nDistribution of number of classes attended by class standing\r\nThe graph shows that their are less senior participants in number in classes, the data makes it visible that every number of classes had more than three participants from the different class standings.Sophomore had highest variability of the variable number of classes. Another insight that this graph show is the difference between freshman and senior participation. It is clear that the freshman class standing participated in all the different number of classes while senior had a gap at 2-3 number of classes. The freshman class standing overall had a greater participation compared to seniors.\r\n\r\n\r\n\r\nThe average number of classes is shown below grouped by class standing. The table shows that freshman had the highest average in number of classes with 3.41, Juniors had a 2.8, sophomore had a 2.2, the lowest was seniors with a 2.1 participation average.\r\n\r\n# A tibble: 7 x 2\r\n  classstanding_order ave.classes\r\n  <fct>                     <dbl>\r\n1 Freshman                   3.41\r\n2 Sophomore                  2.25\r\n3 Junior                     2.83\r\n4 Senior                     2.1 \r\n5 Graduate                 NaN   \r\n6 Not a student            NaN   \r\n7 <NA>                       2.82\r\n\r\nConclusion:\r\nBased on the EDA I have conducted the one advice I have for the CHC is that may get rid of the option I have realized that one thing that CHC can do differently from the EDA information\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-04-18-cfhl-analysis/cfhl-analysis_files/figure-html5/unnamed-chunk-4-1.png",
    "last_modified": "2021-05-07T10:10:21-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-04-09-buildingdistill/",
    "title": "Why I Built This Blog",
    "description": "\"A Brief Overview Why I Built This Blog\"",
    "author": [
      {
        "name": "Demetrio Munoz",
        "url": {}
      }
    ],
    "date": "2021-04-09",
    "categories": [],
    "contents": "\r\nI built this website to post information about me. I built this website because I wanted to create my first website with the package called distill, using the R studio, and R language. I decide to create this website as a blog because I want to be able to post about the projects I will be working , worked on. The other reason why I created this website was to show that I am starting to learn the language R. By building this website I have taught myself lots of new things, how to trouble shoot, fix the problem.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-04-09-buildingdistill/supreme_transformers.jpg",
    "last_modified": "2021-05-07T10:31:22-07:00",
    "input_file": {}
  }
]
